{
  "blogs": [
    {
      "title": "Breaded Pork Chops",
      "blogDescription": "In a shallow bowl, combine egg and milk. Place cracker crumbs in another shallow bowl. Dip each pork chop in egg mixture, then coat with cracker crumbs, patting to make a thick coating.\nIn a large skillet, cook chops in oil for 4-5 minutes on each side or until a thermometer reads 145°. Let meat stand for 5 minutes before serving.",
      "author": "The best grandma ever ❤️",
      "id": 7
    },
    {
      "title": "Deep-Dish Sausage Pizza",
      "blogDescription": "In a large bowl, dissolve yeast in warm water. Add 1 cup flour, oil and crust seasonings; beat until smooth. Add enough remaining flour to form a soft dough.\nTurn onto a floured surface; knead until smooth and elastic, 6-8 minutes. Place in a greased bowl; turn once to grease top. Cover and let rise in a warm place until doubled, about 1 hour.\nPunch dough down; roll out into a 15-in. circle. Transfer to a well-greased 12-in. heavy ovenproof skillet or round baking pan, letting crust drape over edges. Sprinkle with 1 cup mozzarella.\nIn a skillet, saute the green peppers, onion and topping seasonings in oil until tender; drain. Layer half the mixture over crust. Layer with half the Parmesan, sausage and tomatoes. Sprinkle with 2 cups mozzarella. Repeat layers. Fold crust over to form an edge.\nBake at 400° for 20 minutes. Sprinkle with pepperoni and remaining mozzarella. Bake until crust is browned, 10-15 minutes longer. Let stand for 10 minutes before slicing.",
      "author": "The best grandma ever ❤️",
      "id": 8
    },
    {
      "title": "Chicken Paprikash",
      "blogDescription": "Season chicken with kosher salt and pepper. In a Dutch oven, heat peanut oil over medium-high heat. Brown chicken in batches. Remove with a slotted spoon; drain and keep warm.\nReduce heat to medium-low. Add onions; cook, stirring to loosen browned bits from pan, until onions begin to soften, 6-8 minutes. Add garlic; cook 1 minute longer.\nStir in flour and paprika; reduce heat to low. Cook until paprika is fragrant, 3-5 minutes. Add broth; cook, stirring constantly, until smooth, 6-8 minutes. Return chicken to pan; simmer, covered, until a thermometer inserted into deepest part of thigh reads 170°, about 30 minutes. Transfer chicken to a serving platter.\nSkim fat. Stir in sour cream; heat just until warmed through, 3-5 minutes (do not allow to boil). If desired, sprinkle with parsley and additional paprika. Serve with hot cooked noodles or mashed potatoes.",
      "author": "Louis",
      "id": 9
    },
    {
      "title": "Chicken Escarole Soup with Meatballs",
      "blogDescription": "In a stockpot, combine wings, carrots, potato, celery, tomato, onion, 1 Tbsp. salt, pepper and water. Bring to a boil. Reduce heat; cover and simmer for 1 hour or until chicken and vegetables are tender.\nMeanwhile, for the meatballs, combine egg, bread crumbs, parsley, garlic, cheese and the remaining salt in a large bowl. Crumble beef into mixture and mix lightly but thoroughly. Shape into marble-sized balls.\nRemove chicken meat from bones and cut into bite-sized pieces. Discard bones. Return chicken to the pot. Add meatballs and escarole; cook until meatballs are no longer pink, about 10 minutes longer.",
      "author": "The best grandma ever ❤️",
      "id": 10
    },
    {
      "title": "abuela",
      "blogDescription": "ytrersrdtfyguhijok;l'\n",
      "author": "",
      "id": 11
    },
    {
      "title": "Chicken Escarole Soup with Meatballs",
      "blogDescription": "n a stockpot, combine wings, carrots, potato, celery, tomato, onion, 1 Tbsp. salt, pepper and water. Bring to a boil. Reduce heat; cover and simmer for 1 hour or until chicken and vegetables are tender.\nMeanwhile, for the meatballs, combine egg, bread crumbs, parsley, garlic, cheese and the remaining salt in a large bowl. Crumble beef into mixture and mix lightly but thoroughly. Shape into marble-sized balls.\nRemove chicken meat from bones and cut into bite-sized pieces. Discard bones. Return chicken to the pot. Add meatballs and escarole; cook until meatballs are no longer pink, about 10 minutes longer.",
      "author": "gma nelly",
      "id": 12
    }
  ]
}